app/views/blog_posts/show.html.erb

	</div>
	<% @blog_post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 1]]