app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    @blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("title", "blog_entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save

UPDATE "blog_posts" SET "author" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["author", "Elijah"], ["updated_at", "2015-08-25 13:45:57.319394"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_blog_post
      @blog_post = BlogPost.find(params[:id])