app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "comment_entry", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Brown"], ["comment_entry", "Nice entry"], ["blog_post_id", 1], ["created_at", "2015-08-25 13:50:58.968427"], ["updated_at", "2015-08-25 13:50:58.968427"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save